Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G74B.tmx
Source language: en_us
Languages: zh_cn

source: Three months to find a wife
zh_cn: 三个月内找个妻

source: I'm an only child: I suspect my birth may have been a surprise in a marriage of convenience that had never planned to add me to the scene.
zh_cn: 我是一个独生子：我怀疑我的出生对于一段从未考虑过把我带到这个世界上的形婚来说完全是个意外。

source: In fact, I waited six years before appearing, and then I travelled hither and yon, often alone, in three nations: as a toddler on the mid-Atlantic islands of Ascension and St Vincent, to three schools in Brazil and one in Argentina, before coming to board in England at 16.
zh_cn: 实际上，他们结婚六年才有了我，而且我经常是独自一人在三个国家四处游荡：在16岁来英格兰开始寄宿生活之前，我在阿森松和圣文森特的中大西洋群岛上度过了自己的孩童时期，后来又去了三所巴西的学校和一所阿根廷的学校。

source: I spoke Portuguese before English, and was cuddled more by my dark-skinned and much-loved Juvita than by my mother.
zh_cn: 在说英语之前我说的是葡萄牙语，并且我从我深肤色的非常受人爱戴的朱维塔那里得到的拥抱比从我母亲那里得到的还要多。

source: I tend to think now that my father had had no intention of marrying anybody, even that were he to arrive on Earth today he'd be a fastidious and agreeable gay man.
zh_cn: 现在，我更倾向于认为我的父亲没有娶任何人的意思，我甚至认为如果他出生于今天，他很可能会是一个考究的合适的男同性恋。

source: That was, of course, unthinkable in his day, even to himself - a concept that would have horrified his prim and utterly upright soul. (Mother never commented on his somewhat odd late-life hobby of dressing little cut-out dolls.)
zh_cn: 当然，这在他生活的年代，甚至对于他自己来说都是难以想象的——这是一个会使他循规蹈矩，完全正直的灵魂感到震惊的观念。（我的母亲从未对他晚年稍有古怪的喜欢装饰小纸板娃娃的爱好作出评价。）

source: Marriage never occurred to him until he was 27, in 1925, when his company, hinting at promotion to Brazil, suggested that "if he had marriage in mind, there was no time like the present".
zh_cn: 婚姻从来都与我父亲扯不上关系直到他27岁。那是1925年，他的公司正在进行巴西市场推广，并暗示“如果他考虑结婚，现在的状况就会立刻得到改变”。

source: They allowed him three months to get it done, before boarding a ship for Brazil, stopping in Madeira for a week to celebrate the wedding.
zh_cn: 在登上一艘去往巴西，并会在马德拉岛停靠一星期庆祝婚礼的船之前，他们给了我父亲3个月的时间去完成这件事情。

source: The company was Cable & Wireless, Western Telegraph.
zh_cn: 这家公司是Cable & Wireless，Western Telegraph。

source: The son of a baker, he'd left school at 14 but had energy and drive.
zh_cn: 我父亲是一个面包师的儿子，虽然他14岁就离开了学校，但是他却精力充沛，干劲十足。

source: From being the last in the telegraph chain, the lad who took them to the door, he rose to being the first, one of those who tapped them out.
zh_cn: 从这个电讯公司链条的最底端，一个为人引路开门的小伙子一步一步地爬到了公司的高层，并成为了主宰他人命运的那群人中的一员。

source: The company urged him on to night-school, where he excelled at morse code and learned about electricity, but they couldn't have imagined the thoroughness with which he would search for a bride during those three months.
zh_cn: 公司鼓励我父亲上夜校，在那里他很擅长于莫尔斯电码并且学到了很多关于电力的知识，但是他们完全无法想象他可以在短短的3个月时间里找到一个新娘。

source: Until then, he had apparently given all his leisure time to golf, tennis and (sedate) motorcycling - even abroad and after marriage, a bike remained his favourite photographic subject.
zh_cn: 直到那时，我父亲显然是把他所有的休闲时间都给了高尔夫，网球和（稳重的）摩托车运动——甚至是在国外和结婚之后，一辆摩托车依然是他最喜欢的摄影主题。

source: Now, for his hunt, he acquired a huge new Harley Davidson with sidecar - but restricted it to 30mph, not only to calm the candidates (if they knew they were such) but also from an attitude he maintained towards any vehicle all his life.
zh_cn: 现在，为了他猎寻妻子的旅行，他新买了一辆巨大的带有边车的哈雷戴维森（著名机车品牌）——但是限速每小时30英里，不仅是为了使候选人不会失声尖叫，而且是基于我父亲毕生保持的对任何交通工具的一种态度。

source: He must have made a plan, because he always did.
zh_cn: 他一定是已经制定好了一个计划，因为他总是会制定一个。

source: Simple. Take them to lunch. Concentrate. Then choose a wife.
zh_cn: 简单看一下，请她们吃中午饭，仔细考虑考虑，然后挑一个老婆。

source: It didn't work like that.
zh_cn: 但是事情并没有按这样进行。

source: His Voigtlander had rarely taken pictures of people, let alone of women, but suddenly, as if he'd bought a more enlightened camera, he realised the need to spot women.
zh_cn: 我父亲的福伦达相机很少拍人，更不要说女人了，但是忽然地，他好像买了一个更高级的相机，并且意识到他需要给女人拍照片。

source: He buzzed around the south, from beach to countryside, but his albums offer only tantalising glimpses, for he never did bother with captions.
zh_cn: 于是他就在南部走马观花式地旅行，一路从海滨骑到了乡村，但是他的相册只给出了关于这段旅途诱人的大致情况，毕竟我的父亲从不会在文字说明上花费时间。
